Revit 2026 API

# ReferenceArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferenceArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
ReferenceArrayIterator()
```
```fsharp
new : unit -> ReferenceArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ReferenceArrayIterator Class

Autodesk.Revit.DB Namespace